benchmarks/k6/results/duplicate-storm.stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/k6/duplicate-storm.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * duplicate_storm: 1 iterations for each of 50 VUs (maxDuration: 30s, gracefulStop: 30s)

time="2026-08-16T03:46:16+05:30" level=info msg="[duplicate-storm] 50 concurrent identical requests -> completed delta = 1 (must be exactly 1)" source=console


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 55      766.742876/s
    checks_succeeded...: 100.00% 55 out of 55
    checks_failed......: 0.00%   0 out of 55

    ✓ account created (201)
    ✓ funded (201)
    ✓ metrics ok (200)
    ✓ got 201 (won the race) or 409 (correctly rejected)

    HTTP
    http_req_duration..............: avg=39.13ms min=409µs   med=43.14ms max=48.01ms p(90)=46.83ms p(95)=47.27ms
      { expected_response:true }...: avg=39.13ms min=409µs   med=43.14ms max=48.01ms p(90)=46.83ms p(95)=47.27ms
    http_req_failed................: 0.00% 0 out of 55
    http_reqs......................: 55    766.742876/s

    EXECUTION
    iteration_duration.............: avg=43.47ms min=21.57ms med=44.03ms max=49.22ms p(90)=47.43ms p(95)=47.78ms
    iterations.....................: 50    697.038978/s

    NETWORK
    data_received..................: 26 kB 368 kB/s
    data_sent......................: 17 kB 238 kB/s



running (0m00.1s), 00/50 VUs, 50 complete and 0 interrupted iterations
duplicate_storm ✓ [ 100% ] 50 VUs  00.1s/30s  50/50 iters, 1 per VU