benchmarks/k6/results/hot-account-contention.stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/k6/hot-account-contention.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 50s max duration (incl. graceful stop):
              * hot_account_contention: 30 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 30/30 VUs, 117 complete and 0 interrupted iterations
hot_account_contention   [   5% ] 30 VUs  01.0s/20s

running (02.0s), 30/30 VUs, 280 complete and 0 interrupted iterations
hot_account_contention   [  10% ] 30 VUs  02.0s/20s

running (03.0s), 30/30 VUs, 446 complete and 0 interrupted iterations
hot_account_contention   [  15% ] 30 VUs  03.0s/20s

running (04.0s), 30/30 VUs, 607 complete and 0 interrupted iterations
hot_account_contention   [  20% ] 30 VUs  04.0s/20s

running (05.0s), 30/30 VUs, 776 complete and 0 interrupted iterations
hot_account_contention   [  25% ] 30 VUs  05.0s/20s

running (06.0s), 30/30 VUs, 936 complete and 0 interrupted iterations
hot_account_contention   [  30% ] 30 VUs  06.0s/20s

running (07.0s), 30/30 VUs, 1097 complete and 0 interrupted iterations
hot_account_contention   [  35% ] 30 VUs  07.0s/20s

running (08.0s), 30/30 VUs, 1272 complete and 0 interrupted iterations
hot_account_contention   [  40% ] 30 VUs  08.0s/20s

running (09.0s), 30/30 VUs, 1409 complete and 0 interrupted iterations
hot_account_contention   [  45% ] 30 VUs  09.0s/20s

running (10.0s), 30/30 VUs, 1559 complete and 0 interrupted iterations
hot_account_contention   [  50% ] 30 VUs  10.0s/20s

running (11.0s), 30/30 VUs, 1697 complete and 0 interrupted iterations
hot_account_contention   [  55% ] 30 VUs  11.0s/20s

running (12.0s), 30/30 VUs, 1864 complete and 0 interrupted iterations
hot_account_contention   [  60% ] 30 VUs  12.0s/20s

running (13.0s), 30/30 VUs, 2033 complete and 0 interrupted iterations
hot_account_contention   [  65% ] 30 VUs  13.0s/20s

running (14.0s), 30/30 VUs, 2200 complete and 0 interrupted iterations
hot_account_contention   [  70% ] 30 VUs  14.0s/20s

running (15.0s), 30/30 VUs, 2369 complete and 0 interrupted iterations
hot_account_contention   [  75% ] 30 VUs  15.0s/20s

running (16.0s), 30/30 VUs, 2531 complete and 0 interrupted iterations
hot_account_contention   [  80% ] 30 VUs  16.0s/20s

running (17.0s), 30/30 VUs, 2694 complete and 0 interrupted iterations
hot_account_contention   [  85% ] 30 VUs  17.0s/20s

running (18.0s), 30/30 VUs, 2854 complete and 0 interrupted iterations
hot_account_contention   [  90% ] 30 VUs  18.0s/20s

running (19.0s), 30/30 VUs, 3009 complete and 0 interrupted iterations
hot_account_contention   [  95% ] 30 VUs  19.0s/20s

running (20.0s), 30/30 VUs, 3172 complete and 0 interrupted iterations
hot_account_contention   [ 100% ] 30 VUs  20.0s/20s
time="2026-08-16T03:46:49+05:30" level=info msg="[hot-account-contention] completed: 9344 -> 11860 (retries: 14068 -> 32835, exhausted: 116 -> 809)" source=console
time="2026-08-16T03:46:49+05:30" level=info msg="[hot-account-contention] final balance 4ed21cca-6e43-477f-9b5e-fb28ccea12e5 = 99999670" source=console
time="2026-08-16T03:46:49+05:30" level=info msg="[hot-account-contention] final balance 6bcd6e9b-413f-49e4-a3cc-5566978786ab = 99999690" source=console
time="2026-08-16T03:46:49+05:30" level=info msg="[hot-account-contention] final balance 6d8dfa43-7952-46a2-9ca5-01d3a1ac4900 = 100000640" source=console


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=384.31ms


  █ TOTAL RESULTS 

    checks_total.......: 3217    158.337976/s
    checks_succeeded...: 100.00% 3217 out of 3217
    checks_failed......: 0.00%   0 out of 3217

    ✓ account created (201)
    ✓ funded (201)
    ✓ metrics ok (200)
    ✓ transfer succeeded or bounded-retry-exhausted

    HTTP
    http_req_duration..............: avg=166.98ms min=364µs   med=113.95ms max=573.19ms p(90)=368.41ms p(95)=384.31ms
      { expected_response:true }...: avg=112ms    min=364µs   med=61.53ms  max=543.15ms p(90)=288.87ms p(95)=333.49ms
    http_req_failed................: 21.52% 693 out of 3220
    http_reqs......................: 3220   158.485633/s

    EXECUTION
    iteration_duration.............: avg=187.96ms min=27.11ms med=135.41ms max=595.24ms p(90)=388.78ms p(95)=404.64ms
    iterations.....................: 3209   157.944223/s
    vus............................: 30     min=30          max=30
    vus_max........................: 30     min=30          max=30

    NETWORK
    data_received..................: 1.5 MB 74 kB/s
    data_sent......................: 1.1 MB 54 kB/s



running (20.3s), 00/30 VUs, 3209 complete and 0 interrupted iterations
hot_account_contention ✓ [ 100% ] 30 VUs  20s